# Практическая работа по уроку "Динамическая типизация"
#
# • Цель: написать программу на Python для демонстрации динамической типизации с использованием Pycharm.
# • Создайте переменные разных типов данных, включая имя (строка) и возраст (целое число).
# • Выведите значения переменных на экран с помощью функции print().
# • Обратите внимание на использование разных типов данных и возможности их изменения.

name = "Aleks"
print("Name:", name)
age = 39
print("Age:", age)
age = age + 1
print("New Age:", age)
is_student = True
print("Is Student:", is_student)
